[
  {
    "Name": "administrative",
    "Title": "Academic Administrative Jobs",
    "Description": "Academic administrative jobs are rewarding and challenging, but also diverse and dynamic. They require a high level of professionalism, interpersonal skills, and technical skills. ",
    "Keyword": "Academic Administrative Jobs. Academic Administrative positions",
    "content": "Academic administrative jobs are the roles that provide essential services and functions to the academic community. They include roles such as academic advisors, admissions officers, registrars, financial aid officers, librarians, IT specialists. Academic administrative jobs are  assist students, faculty, and staff with various aspects of their academic journey, such as registration, enrollment, graduation, transcripts, scholarships, research grants, and academic policies."
  },
  {
    "Name": "estates facilities management",
    "Title": "Academic Estates & Facilities Management Jobs",
    "Description": "If you think you have what it takes to be an academic estates or facilities manager, or if you want to learn more about these roles, you can browse the current opportunities.",
    "Keyword": "Academic estates facilities management Jobs. Academic estates facilities management positions",
    "content": "Academic estates and facilities management jobs ensure the safety, functionality, and sustainability of the buildings, grounds, and services of their universities. They can be estates managers, facilities managers, project managers, engineers, technicians. Academic estates and facilities management jobs take care of planning, designing, constructing, operating, and maintaining the physical assets and resources of their institutions. "
  },
  {
    "break1": true,
    "Name": "alumni fundraising",
    "Title": "Academic Fundraising & Alumni Jobs",
    "Description": "You can find Academic Fundraising & Alumni Jobs from various regions, countries, and types of institutions. You can also filter your search by keywords, location, salary range, and date posted. ",
    "Keyword": "Academic Fundraising & Alumni Jobs. Academic Fundraising & Alumnil positions",
    "content": "Academic fundraising and alumni jobs are the roles that support the development and advancement of their institutions. Academic fundraising and alumni jobs are fundraising managers, development officers, alumni relations officers, donor relations officers. Academic fundraising and alumni jobs are behind identifying, cultivating, soliciting, and stewarding donors and alumni who can provide financial and non-financial support to their institutions."
  },
  {
    "Name": "health wellbeing",
    "Title": "Academic Health & Wellbeing Jobs",
    "Description": "Academic Health & Wellbeing Jobs require a thorough knowledge of the policies and regulations affecting the higher education sector in a changing and diverse environment.",
    "Keyword": "Academic health and wellbeing Jobs. Academic health and wellbeing positions",
    "content": "Academic health and wellbeing jobs are the provide essential services and programs to enhance the physical, mental, and social wellbeing of their institutions. These academic positions contain health educators, counsellors, psychologists, nurses, social workers. Academic health and wellbeing jobs provide information, advice, support, and referrals to students, staff, and the wider community on various health and wellbeing issues, such as stress management, mental health, sexual health, alcohol and drug use, nutrition, fitness, and more."
  },
  {
    "break1": true,
    "Name": "hospitality retail conferences events",
    "Title": "Academic Hospitality, Retail, Conferences & Events Jobs",
    "Description": "Academic hospitality, retail, conferences and events jobs are rewarding and challenging, but also diverse and dynamic.  ",
    "Keyword": "Academic hospitality retail conferences events Jobs. hospitality retail conferences events positions",
    "content": "Academic hospitality, retail, conferences and events jobs enhance the experience and satisfaction of the academic community. Academic hospitality, retail, conferences and events jobs consist of catering managers, retail managers, conference coordinators, event planners. They are responsible for planning, managing, and delivering various hospitality, retail, conferences and events activities, such as catering, accommodation, merchandising, exhibitions, seminars, workshops, festivals, and ceremonies."
  },
  {
    "Name": "international activities",
    "Title": "Academic International Activities Jobs",
    "Description": "If you think you have what it takes to get academic international activities jobs, or if you want to learn more about these roles.",
    "Keyword": "Academic international activities Jobs. academic international activities positions",
    "content": "Academic international activities jobs support the development and implementation of the international strategy and vision of their institutions. The higher ed jobs on this page encompass international relations managers, international student advisors, study abroad coordinators, international partnerships officers. Academic international activities jobs run the international mobility, collaboration, and engagement of students, staff, and partners. "
  },
  {
    "break1": true,
    "Name": "IT services",
    "Title": "Academic IT Services Jobs",
    "Description": "Our job board is updated regularly with new and exciting academic IT services jobs. Don’t miss this opportunity to take your career to the next level. ",
    "Keyword": "Academic IT Services jobs. Academic IT Services positions",
    "content": "Academic IT services jobs ensure the availability, reliability, and security of the IT infrastructure and applications: IT managers, network administrators, software developers, web designers, help desk technicians. academic IT services jobs conduct designing, developing, maintaining, and troubleshooting the IT systems and services that support the teaching, learning, research, and administration activities of their institutions. "
  },
  {
    "Name": "laboratory clinical technician",
    "Title": "Academic Laboratory, Clinical & Technician Jobs",
    "Description": "Academic laboratory and clinical technician jobs are rewarding and challenging, but also diverse and dynamic. Go to Academic laboratory and clinical technician jobs and higher ed position today.",
    "Keyword": "Academic laboratory and clinical technician jobs. Academic laboratory and clinical technician positions",
    "content": "Academic laboratory and clinical technician jobs support the teaching, learning, and research activities of their institutions such as: laboratory technicians, clinical technicians, research assistants. Academic laboratory and clinical technician jobs are accoutable for preparing, organising, conducting, and recording laboratory and clinical tests using a range of tools and equipment. "
  },
  {
    "Name": "legal compliance policy",
    "Title": "Academic Legal, Compliance policy Jobs",
    "Description": "Academic Legal, Compliance policy Jobs develop, review, and implement policies and procedures that reflect the mission, vision, and values of their institutions.",
    "Keyword": "Academic Legal, Compliance policy Jobs. Academic Legal, Compliance policy positions",
    "content": "Academic legal compliance and policy jobs govern thre risk management of their institutions with positions like: legal counsel, compliance officer, policy officer. Academic legal compliance and policy jobs aid with legal advice, guidance, and representation to their institutions on various matters, such as contracts, disputes, regulations, and intellectual property."
  },
  {
    "Name": "library services data information management",
    "Title": "Academic Library Services, Data & Information Management Jobs",
    "Description": "Academic library services, data, and information management jobs work closely with the faculty, staff, and students to ensure the quality and accessibility of the information resources and data.",
    "Keyword": "Academic library services data information management Jobs. Academic library services data information management positions",
    "content": "Academic library services, data, and information management jobs are the librarians, data managers, information specialists, archivists. Academic library services, data, and information management jobs see to collecting, organising, preserving, and disseminating the information resources and data that are relevant."
  },
  {
    "break1": true,
    "Name": "pr marketing sales communication",
    "Title": "Academic PR, Marketing, Sales & Communication Jobs",
    "Description": "Our job board is updated regularly with new and exciting academic PR, marketing, sales, and communication jobs.  ",
    "Keyword": "Academic pr marketing sales communication Jobs. academic pr marketing sales communication positions",
    "content": "Academic PR, marketing, sales, and communication jobs engage with PR managers, marketing managers, sales managers, communication officers. Academic PR, marketing, sales, and communication jobs enter the PR, marketing, sales, and communication strategy and campaigns.."
  },
  {
    "Name": "project management consulting",
    "Title": "Academic Project Management & Consulting Jobs",
    "Description": "Do you have the skills, experience, and passion to communicate and promote the value and impact of a university or college? If so, you might want to check out the academic PR, marketing, sales, and communication jobs.",
    "Keyword": "Academic HR occupational health safety Jobs. HR occupational health safety positions",
    "content": "Academic project management and consulting jobs strategize planning, implementation, and evaluation of various projects and initiatives, including roles such as project managers, consultants, analysts, coordinators. Academic project management and consulting jobs define the scope, objectives, deliverables, and outcomes of the projects and initiatives. They also manage the resources, budget, timeline, risks, and stakeholders of the projects. "
  },
  {
    "break1": true,
    "Name": "senior management",
    "Title": "Academic Senior Management Jobs",
    "Description": " Academic Senior Management Jobs oversee the quality and integrity of the academic programs, faculty, research, and student success. ",
    "Keyword": "Academic Senior Management Jobs. Academic Senior Management positions",
    "content": "Academic senior management jobs are the roles that provide strategic direction, operational oversight, and academic leadership to their institutions. Academic senior management jobs work closely with the governing bodies, external stakeholders, and the academic community to ensure the excellence and sustainability. "
  },
  {
    "Name": "sports leisure",
    "Title": "Academic Sports & Leisure Jobs",
    "Description": "Academic Sports & Leisure Jobs must have the passion to teach, coach, or manage sports and leisure activities for students, staff, and the wider community.",
    "Keyword": "Academic Sports & Leisure Jobs. Academic Sports & Leisure positions",
    "content": "Academic sports and leisure jobs aid the physical, mental, and social wellbeing of the academic community through sports and leisure programs and services. These academic roles can include sports science lecturers, sports coaches, sports therapists, fitness instructors, leisure managers. Academic sports and leisure jobs are responsible for designing, delivering, and evaluating various sports and leisure activities, such as fitness classes, team sports, outdoor adventures, recreational events, and wellness workshops."
  },
  {
    "break1": true,
    "Name": "student services",
    "Title": "Academic Student Services Jobs",
    "Description": "If you think you have what it takes to get academic student services jobs, you can browse the current opportunities on our job board. ",
    "Keyword": "Academic Student Services Jobs. Academic Student Services positions",
    "content": "Academic student services jobs develop and maintain programmes designed to support and enhance the student experience and campus life such as with: student advisors, counsellors, career consultants, disability support officers, learning support officers. Academic student services jobs are in control of interacting with students and providing advice for personal and university-related enquiries, such as academic progress, wellbeing, financial assistance, employability, and engagement."
  },
  {
    "Name": "sustainability",
    "Title": "Academic Sustainability Jobs",
    "Description": "Academic sustainability jobs require the skills, experience, and passion to contribute to the environmental, social, and economic sustainability of a university or college.",
    "Keyword": "Academic Sustainability Jobs. Academic Sustainability positions",
    "content": "Academic sustainability jobs implement sustainability strategies and visions as sustainability managers, sustainability officers, sustainability educators, sustainability researchers. Academic sustainability jobs decide planning, managing, and delivering various sustainability initiatives, such as carbon reduction, waste management, energy efficiency, biodiversity, community engagement, and curriculum development."
  },
  {
    "Name": "web design development",
    "Title": "Academic Web Design & Development Jobs",
    "Description": "Academic web design and development jobs work with other senior leaders, such as provosts, deans, and directors, to ensure the alignment and integration of the web strategy with the institutional vision and goals.",
    "Keyword": "Academic web design and development jobs. Academic web design and development positions",
    "content": "Academic web design and development jobs can exist as web designers, web developers, web managers, web analysts. Academic web design and development jobs are behind designing, developing, maintaining, and improving the websites, web applications, and web services that support the teaching, learning, research, and administration activities. "
  },
  {
    "Name": "other admin and support",
    "Title": "Academic Other Admin and Support Jobs",
    "Description": "Academic other admin and support Jobs require a thorough knowledge of the policies and regulations affecting the higher education sector in a changing and diverse environment.",
    "Keyword": "Academic other admin and support Jobs. Academic other admin and support positions",
    "content": "Academic other admin and support jobs provide essential services and functions to the academic community. They include roles such as receptionists, secretaries, assistants, coordinators, and officers, with tasks like data entry, record keeping, filing, scheduling, and reporting."
  }
]
