[


 {
  
   
  
  "Name": "victoria",
  "Title": "Victoria | Job Vacancies Online",
  "Description": "Teaching Jobs in Victoria are now available through our job board at Teaching Jobs. Browse our website to see the available employment positions throughout Victoria.",
  "Keyword": "victoria teaching jobs . melbourne teaching jobs",
  "content": "If you’re on the hunt for teaching jobs in Victoria, TeachingJobs is able to provide you with Australia’s largest resource of employment opportunities. We take the stress out of finding a new teaching job by providing you with an unbeatable selection of exciting job vacancies at your fingertips.By making a profile with us, you’ll be kept up to date on all the latest openings in your area and be the first to know about any new positions. Demonstrate your qualifications, skills and experience to recruiters and get yourself noticed. Whether you’re looking for something in the inner-north of Melbourne or the south-east of Victoria, we have plenty of jobs waiting for the perfect candidate." },
 {

  "Name": "nsw",
  "Title": "NSW | Apply Online | Job Vacancies",
  "Description": "Do you wish to apply for a teaching job in NSW? Visit our website today at Teaching Jobs, to see all our available positions throughout NSW. Apply online now!",
  "Keyword": " nsw teaching jobs . new south whales teaching positions ",
  "content": "If you’re looking for the latest job opportunities in the education sector, look no further than Teaching Jobs. Finding the right teaching jobs in NSW can be difficult and time-consuming, but we go out of our way to make your job hunt as smooth and painless as possible. By making an online profile on our site, you’ll be the first to know about exciting new employment opportunities and NSW teacher jobs. By entering your preferences, you are able to filter out jobs that don’t match your criteria and only be shown vacancies that align with your skills, qualifications and goals."  },
 
 {   
  "break1": true,   
  "Name": "queensland",
  "Title": "Queensland | Apply Online - Job Vacancies",
  "Description": "Teaching Jobs have teaching jobs in QLD available throughout the state. Visit our website to see the employment positions available in private, public and catholic schools.",
  "Keyword": "queensland teaching jobs . queensland teaching positions",
  "content": "Looking for a new challenge? Looking for teaching jobs in Queensland? TeachingJobs is Australia’s leading jobsite for employment resources for education professionals, providing an unbeatable selection of job vacancies across various positions. Covering all types of schools from Christian to Catholic, kindergarten to secondary and everything in between, we have an extensive selection of jobs available for all education professionals.The perfect QLD teacher jobs can be difficult to come by when taking into consideration your personal preferences, skills and qualifications. Sign up to TeachingJobs today and we will do all the hard work for you and notify you of any available positions that match your criteria. This way, you won’t miss out on any dream education jobs you’ve been searching for and can be confident that no opportunities are passing you by."  },
 {
  "Name": "south australia",
  "Title": "South Australia | Apply Online | Vacancies",
  "Description": "At Teaching Jobs, we have a wide range of job vacancies & employments for teaching in Adelaide. Visit our job board for private and public jobs. Apply online now!",
  "Keyword": "aidelaide teaching jobs . south australia teaching jobs",
  "content": "If you’re looking for teaching jobs in Adelaide, TeachingJobs has you covered. We are Australia’s #1 education jobsite with the most comprehensive collection of education jobs available online. We take pride in connecting top educators with fulfilling positions that allow them to inspire, lead and enlighten.Wherever you are in Adelaide, from Mount Osmond to Woodville South, TeachingJobs has a varied range of positions ready for you to browse. Regardless of whether you’re looking for a primary teaching job in Adelaide, a casual relief teaching position or a school aide job, we have plenty of rewarding employment openings just waiting for you to apply."  },
 {
  "break1": true,   
  "Name": "western australia",
  "Title": "Western Australia | Apply Online | Job Vacancies",
  "Description": "Visit our job board today at Teaching Jobs, to see all of our employment and job vacancies available including public, private and catholic teaching jobs in Western Australia.",
  "Keyword": "western australia teaching jobs . western austrlaia teaching positions",
  "content": "Western Australia is a state located in the western part of Australia. It is the largest state in the country, covering an area of 2,529,875 square kilometers. The state is home to a diverse range of flora and fauna, including 13,000 species of wildflowers. Western Australia is known for its mining industry, which is the state’s largest industry, and it is also a significant producer of wheat, wool, and other agricultural products.Western Australia has a well-established education system that provides quality education to students. The Department of Education is the largest employer in the state, providing a range of career opportunities in public education. The department offers a variety of teaching positions, including full-time, part-time, and casual positions. The department also provides a range of attractive professional and personal benefits to its employees"    
},
 
 {
  "Name": "northern territory",
  "Title": "NT | Apply Online  | Job Vacancies",
  "Description": "Are you searching for a teaching job in the NT? Visit our website at Teaching Jobs, to see our available employment positions for teaching jobs in the northern territory",
  "Keyword": "northern terriorty teaching jobs .  northern territory teaching positions",
  "content": "orthern Australia is a vast region that encompasses the northern part of Australia, including the Northern Territory and parts of Western Australia and Queensland. The region is known for its unique landscapes, diverse cultures, and rich history.If you are interested in teaching jobs in Northern Australia, the Northern Territory Department of Education is the largest employer in the region and offers a range of career opportunities in public education. The department provides a variety of teaching positions, including full-time, part-time, and casual positions. It also offers a range of attractive professional and personal benefits to its employees"},
 {
  "break1": true,   
  "Name": "tasmania",
  "Title": "Tasmania  | Apply Online  | Job Vacancies",
  "Description": "Are you searching for a teaching job in the Tasmania? Visit our website at Teaching Jobs, to see our available employment positions for teaching jobs in the Tasmania.",
  "Keyword": "tasmania teaching jobs . tasmania teaching positions",
  "content": "To teach in Tasmania, you must be registered with the Teachers Registration Board (TRB), an independent statutory authority separate from any educational authority. The TRB registers teachers for all Tasmanian schools and colleges. Mutual recognition may apply for teachers who are currently registered in other states or territories. We hope this information helps you in your search for teaching opportunities in Tasmania. Good luck!"  }
 
 
]
 